-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3307
-- Время создания: Сен 23 2019 г., 19:53
-- Версия сервера: 10.3.13-MariaDB
-- Версия PHP: 7.1.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `world_cup`
--

-- --------------------------------------------------------

--
-- Структура таблицы `matches`
--

CREATE TABLE `matches` (
  `match_id` int(11) NOT NULL,
  `match_first` varchar(30) NOT NULL,
  `match_second` varchar(30) NOT NULL,
  `match_first_score` int(11) NOT NULL,
  `match_second_score` int(11) NOT NULL,
  `match_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `matches`
--

INSERT INTO `matches` (`match_id`, `match_first`, `match_second`, `match_first_score`, `match_second_score`, `match_date`) VALUES
(1, 'Россия', 'Саудовская Аравия', 5, 0, '2018-06-14'),
(2, 'Египет', 'Уругвай', 0, 1, '2018-06-15'),
(3, 'Марокко', 'Иран', 0, 1, '2018-06-15'),
(4, 'Португалия', 'Испания', 3, 3, '2018-06-15'),
(5, 'Франция', 'Австралия', 2, 1, '2018-06-16'),
(6, 'Аргентина', 'Исландия', 1, 1, '2018-06-16'),
(7, 'Перу', 'Дания', 0, 1, '2018-06-16'),
(8, 'Хорватия', 'Нигерия', 2, 0, '2018-06-16'),
(9, 'Коста-Рика', 'Сербия', 0, 1, '2018-06-17'),
(10, 'Германия', 'Мексика', 0, 1, '2018-06-17'),
(11, 'Бразилия', 'Швейцария', 1, 1, '2018-06-17'),
(12, 'Швеция', 'Республика Корея', 1, 0, '2018-06-18'),
(13, 'Бельгия', 'Панама', 3, 0, '2018-06-18'),
(14, 'Тунис', 'Англия', 1, 2, '2018-06-18'),
(15, 'Колумбия', 'Япония', 1, 2, '2018-06-19'),
(16, 'Польша', 'Сенегал', 1, 2, '2018-06-19'),
(17, 'Россия', 'Египет', 3, 1, '2018-06-19'),
(18, 'Португалия', 'Марокко', 1, 0, '2018-06-20'),
(19, 'Уругвай', 'Саудовская Аравия', 1, 0, '2018-06-20'),
(20, 'Иран', 'Испания', 0, 1, '2018-06-20'),
(21, 'Дания', 'Австралия', 1, 1, '2018-06-21'),
(22, 'Франция', 'Перу', 1, 0, '2018-06-21'),
(23, 'Аргентина', 'Хорватия', 0, 3, '2018-06-21'),
(24, 'Бразилия', 'Коста-Рика', 2, 0, '2018-06-22'),
(25, 'Нигерия', 'Исландия', 2, 0, '2018-06-22'),
(26, 'Сербия', 'Швейцария', 1, 2, '2018-06-22'),
(27, 'Бельгия', 'Тунис', 5, 2, '2018-06-23'),
(28, 'Республика Корея', 'Мексика', 1, 2, '2018-06-23'),
(29, 'Германия', 'Швеция', 2, 1, '2018-06-23'),
(30, 'Англия', 'Панама', 6, 1, '2018-06-24'),
(31, 'Япония', 'Сенегал', 2, 2, '2018-06-24'),
(32, 'Польша', 'Колумбия', 0, 3, '2018-06-24'),
(33, 'Уругвай', 'Россия', 3, 0, '2018-06-25'),
(34, 'Саудовская Аравия', 'Египет', 2, 1, '2018-06-25'),
(35, 'Испания', 'Марокко', 2, 2, '2018-06-25'),
(36, 'Иран', 'Португалия', 1, 1, '2018-06-25'),
(37, 'Австралия', 'Перу', 0, 2, '2018-06-26'),
(38, 'Дания', 'Франция', 0, 0, '2018-06-26'),
(39, 'Нигерия', 'Аргентина', 1, 2, '2018-06-26'),
(40, 'Исландия', 'Хорватия', 1, 2, '2018-06-26'),
(41, 'Республика Корея', 'Германия', 2, 0, '2018-06-27'),
(42, 'Мексика', 'Швеция', 0, 3, '2018-06-27'),
(43, 'Сербия', 'Бразилия', 0, 2, '2018-06-27'),
(44, 'Швейцария', 'Коста-Рика', 2, 2, '2018-06-27'),
(45, 'Япония', 'Польша', 0, 1, '2018-06-28'),
(46, 'Сенегал', 'Колумбия', 0, 1, '2018-06-28'),
(47, 'Панама', 'Тунис', 1, 2, '2018-06-28'),
(48, 'Англия', 'Бельгия', 0, 1, '2018-06-28'),
(55, 'Франция', 'Аргентина', 4, 3, '2018-06-30'),
(56, 'Уругвай', 'Португалия', 2, 1, '2018-06-30'),
(57, 'Бразилия', 'Мексика', 2, 0, '2018-07-02'),
(58, 'Бельгия', 'Япония', 3, 2, '2018-07-02'),
(59, 'Испания', 'Россия', 1, 1, '2018-07-01'),
(60, 'Хорватия', 'Дания', 1, 1, '2018-07-01'),
(61, 'Швеция', 'Швейцария', 1, 0, '2018-07-03'),
(62, 'Колумбия', 'Англия', 1, 1, '2018-07-03'),
(63, 'Уругвай', 'Франция', 0, 2, '2018-07-06'),
(64, 'Бразилия', 'Бельгия', 1, 2, '2018-07-06'),
(65, 'Россия', 'Хорватия', 2, 2, '2018-07-07'),
(66, 'Швеция', 'Англия', 0, 2, '2018-07-07'),
(67, 'Франция', 'Бельгия', 1, 0, '2018-07-10'),
(68, 'Хорватия', 'Англия', 2, 1, '2018-07-11'),
(69, 'Франция', 'Хорватия', 4, 2, '2018-07-15'),
(70, 'Бельгия', 'Англия', 2, 0, '2018-07-14');

-- --------------------------------------------------------

--
-- Структура таблицы `players`
--

CREATE TABLE `players` (
  `player_id` int(11) NOT NULL,
  `player_name` varchar(20) NOT NULL,
  `player_surname` varchar(20) NOT NULL,
  `player_team` varchar(30) NOT NULL,
  `player_number` int(11) NOT NULL,
  `player_age` int(11) NOT NULL,
  `player_games` int(11) NOT NULL,
  `player_minutes` int(11) NOT NULL,
  `player_goals` int(11) NOT NULL,
  `player_assists` int(11) NOT NULL,
  `player_hits` int(11) NOT NULL,
  `player_passes` int(11) NOT NULL,
  `player_takes` int(11) NOT NULL,
  `player_yellow` int(11) NOT NULL,
  `player_red` int(11) NOT NULL,
  `player_saves` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `players`
--

INSERT INTO `players` (`player_id`, `player_name`, `player_surname`, `player_team`, `player_number`, `player_age`, `player_games`, `player_minutes`, `player_goals`, `player_assists`, `player_hits`, `player_passes`, `player_takes`, `player_yellow`, `player_red`, `player_saves`) VALUES
(51, 'Игорь', 'Акинфеев', 'Россия', 1, 33, 5, 510, 0, 0, 0, 123, 0, 0, 0, 15),
(52, 'Андрей', 'Лунев', 'Россия', 12, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(53, 'Владимир', 'Габулов', 'Россия', 20, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(54, 'Марио', 'Фернандес', 'Россия', 2, 28, 5, 472, 1, 1, 1, 173, 9, 0, 0, 0),
(55, 'Илья', 'Кутепов', 'Россия', 3, 26, 5, 510, 0, 1, 0, 150, 10, 1, 0, 0),
(56, 'Сергей', 'Игнашевич', 'Россия', 4, 40, 5, 510, 0, 0, 2, 154, 3, 0, 0, 0),
(57, 'Андрей', 'Семенов', 'Россия', 5, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(58, 'Федор', 'Кудряшов', 'Россия', 13, 32, 4, 335, 0, 0, 0, 98, 1, 0, 0, 0),
(59, 'Владимир', 'Гранат', 'Россия', 14, 32, 1, 75, 0, 0, 0, 4, 0, 0, 0, 0),
(60, 'Игорь', 'Смольников', 'Россия', 23, 31, 1, 36, 0, 0, 0, 11, 1, 0, 1, 0),
(61, 'Денис', 'Черышев', 'Россия', 6, 28, 5, 304, 4, 0, 12, 78, 1, 0, 0, 0),
(62, 'Далер', 'Кузяев', 'Россия', 7, 26, 5, 304, 0, 0, 2, 88, 8, 0, 0, 0),
(63, 'Юрий', 'Газинский', 'Россия', 8, 30, 4, 266, 1, 0, 2, 114, 2, 2, 0, 0),
(64, 'Алан', 'Дзагоев', 'Россия', 9, 29, 2, 42, 0, 1, 1, 20, 0, 0, 0, 0),
(65, 'Роман', 'Зобнин', 'Россия', 11, 25, 5, 510, 0, 1, 7, 179, 11, 1, 0, 0),
(66, 'Алексей', 'Миранчук', 'Россия', 15, 23, 1, 60, 0, 0, 0, 22, 1, 0, 0, 0),
(67, 'Антон', 'Миранчук', 'Россия', 16, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(68, 'Александр', 'Головин', 'Россия', 17, 23, 4, 402, 1, 2, 3, 132, 5, 1, 0, 0),
(69, 'Юрий', 'Жирков', 'Россия', 18, 36, 3, 221, 0, 0, 2, 64, 4, 0, 0, 0),
(70, 'Александр', 'Самедов', 'Россия', 19, 35, 5, 359, 0, 0, 2, 138, 6, 0, 0, 0),
(71, 'Александр', 'Ерохин', 'Россия', 21, 29, 3, 89, 0, 0, 2, 14, 0, 0, 0, 0),
(72, 'Федор', 'Смолов', 'Россия', 10, 29, 5, 219, 0, 0, 2, 67, 2, 1, 0, 0),
(73, 'Артем', 'Дзюба', 'Россия', 22, 31, 5, 333, 3, 2, 8, 91, 4, 0, 0, 0),
(74, 'Тибо', 'Куртуа', 'Бельгия', 1, 27, 7, 630, 0, 0, 0, 231, 0, 0, 0, 27),
(75, 'Симон', 'Миньоле', 'Бельгия', 12, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(76, 'Кун', 'Кастелс', 'Бельгия', 13, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(77, 'Тоби', 'Алдервейрелд', 'Бельгия', 2, 30, 6, 540, 0, 1, 5, 453, 2, 2, 0, 0),
(78, 'Томас', 'Вермален', 'Бельгия', 3, 33, 3, 132, 0, 0, 0, 76, 1, 0, 0, 0),
(79, 'Венсан', 'Компани', 'Бельгия', 4, 33, 5, 376, 0, 0, 4, 288, 6, 0, 0, 0),
(80, 'Ян', 'Вертонген', 'Бельгия', 5, 32, 6, 540, 1, 0, 2, 321, 7, 2, 0, 0),
(81, 'Тома', 'Менье', 'Бельгия', 15, 27, 5, 450, 1, 2, 6, 203, 1, 2, 0, 0),
(82, 'Дедрик', 'Бойата', 'Бельгия', 20, 28, 3, 270, 0, 0, 1, 193, 2, 0, 0, 0),
(83, 'Леандер', 'Дендонкер', 'Бельгия', 23, 24, 1, 90, 0, 0, 0, 72, 0, 1, 0, 0),
(84, 'Аксель', 'Витсель', 'Бельгия', 6, 30, 6, 539, 0, 0, 6, 332, 1, 1, 0, 0),
(85, 'Кевин', 'Де Брейне', 'Бельгия', 7, 28, 6, 540, 1, 2, 13, 344, 3, 1, 0, 0),
(86, 'Маруан', 'Феллайни', 'Бельгия', 8, 31, 5, 316, 1, 0, 5, 133, 7, 0, 0, 0),
(87, 'Янник', 'Карраско', 'Бельгия', 11, 25, 4, 239, 0, 0, 6, 75, 0, 0, 0, 0),
(88, 'Торган', 'Азар', 'Бельгия', 16, 26, 2, 97, 0, 0, 3, 50, 1, 0, 0, 0),
(89, 'Юри', 'Тилеманс', 'Бельгия', 17, 22, 4, 175, 0, 2, 3, 115, 7, 1, 0, 0),
(90, 'Мусса', 'Дембеле', 'Бельгия', 19, 32, 4, 178, 0, 0, 0, 115, 5, 0, 0, 0),
(91, 'Насер', 'Шадли', 'Бельгия', 22, 30, 6, 327, 1, 1, 3, 167, 1, 0, 0, 0),
(92, 'Ромелу', 'Лукаку', 'Бельгия', 9, 26, 6, 476, 4, 1, 13, 97, 1, 0, 0, 0),
(93, 'Эден', 'Азар', 'Бельгия', 10, 28, 6, 518, 3, 2, 17, 267, 1, 1, 0, 0),
(94, 'Дрис', 'Мертенс', 'Бельгия', 14, 32, 6, 298, 1, 1, 7, 122, 0, 0, 0, 0),
(95, 'Аднан', 'Янузай', 'Бельгия', 18, 24, 1, 86, 0, 0, 4, 20, 0, 0, 0, 0),
(96, 'Миши', 'Батшуайи', 'Бельгия', 21, 25, 3, 113, 1, 0, 8, 25, 0, 0, 0, 0),
(98, 'Уго', 'Льорис', 'Франция', 1, 32, 6, 540, 0, 0, 0, 152, 0, 0, 0, 12),
(99, 'Стив', 'Манданда', 'Франция', 16, 34, 1, 90, 0, 0, 0, 26, 0, 0, 0, 1),
(100, 'Альфонс', 'Ареоля', 'Франция', 23, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(101, 'Бенжамен', 'Павар', 'Франция', 2, 23, 6, 540, 1, 0, 4, 258, 14, 1, 0, 0),
(102, 'Преснель', 'Кимпембе', 'Франция', 3, 24, 1, 90, 0, 0, 0, 72, 0, 0, 0, 0),
(103, 'Рафаэль', 'Варан', 'Франция', 4, 26, 7, 630, 1, 0, 4, 330, 1, 0, 0, 0),
(104, 'Самюэль', 'Умтити', 'Франция', 5, 25, 6, 540, 1, 0, 2, 203, 2, 0, 0, 0),
(105, 'Адиль', 'Рами', 'Франция', 17, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(106, 'Джибриль', 'Сидибе', 'Франция', 19, 27, 1, 90, 0, 0, 0, 95, 2, 0, 0, 0),
(107, 'Люка', 'Эрнандес', 'Франция', 21, 23, 7, 590, 0, 2, 6, 202, 9, 2, 0, 0),
(108, 'Бенжамен', 'Менди', 'Франция', 22, 25, 1, 40, 0, 0, 0, 31, 0, 0, 0, 0),
(109, 'Поль', 'Погба', 'Франция', 6, 26, 6, 539, 1, 0, 8, 296, 8, 1, 0, 0),
(110, 'Корантен', 'Толиссо', 'Франция', 12, 25, 5, 194, 0, 1, 2, 125, 1, 1, 0, 0),
(111, 'Нголо', 'Канте', 'Франция', 13, 28, 7, 595, 0, 0, 1, 365, 5, 2, 0, 0),
(112, 'Блез', 'Матюиди', 'Франция', 14, 32, 5, 337, 0, 0, 4, 115, 8, 2, 0, 0),
(113, 'Стивен', 'Нзонзи', 'Франция', 15, 30, 5, 141, 0, 0, 0, 92, 0, 0, 0, 0),
(114, 'Антуан', 'Гризманн', 'Франция', 7, 28, 7, 570, 4, 2, 21, 244, 11, 0, 0, 0),
(115, 'Тома', 'Лемар', 'Франция', 8, 23, 1, 90, 0, 0, 1, 56, 0, 0, 0, 0),
(116, 'Оливье', 'Жиру', 'Франция', 9, 32, 7, 546, 0, 1, 15, 114, 3, 1, 0, 0),
(117, 'Килиан', 'Мбаппе', 'Франция', 10, 20, 7, 534, 4, 0, 8, 160, 2, 2, 0, 0),
(118, 'Усман', 'Дембеле', 'Франция', 11, 22, 4, 165, 0, 0, 3, 71, 0, 0, 0, 0),
(119, 'Набиль', 'Фекир', 'Франция', 18, 26, 6, 70, 0, 0, 4, 36, 0, 0, 0, 0),
(120, 'Флориан', 'Товен', 'Франция', 20, 26, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0),
(121, 'Доминик', 'Ливакович', 'Хорватия', 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(122, 'Ловре', 'Калинич', 'Хорватия', 12, 29, 1, 90, 0, 0, 0, 23, 0, 0, 0, 5),
(123, 'Даниэль', 'Субашич', 'Хорватия', 23, 34, 6, 630, 0, 0, 0, 199, 0, 0, 0, 15),
(124, 'Шиме', 'Врсалько', 'Хорватия', 2, 27, 6, 607, 0, 1, 6, 305, 8, 2, 0, 0),
(125, 'Иван', 'Стринич', 'Хорватия', 3, 32, 6, 511, 0, 0, 0, 241, 3, 1, 0, 0),
(126, 'Ведран', 'Чорлука', 'Хорватия', 5, 33, 4, 119, 0, 0, 0, 66, 3, 1, 0, 0),
(127, 'Деян', 'Ловрен', 'Хорватия', 6, 30, 7, 650, 0, 0, 5, 374, 2, 1, 0, 0),
(128, 'Тин', 'Едвай', 'Хорватия', 13, 23, 1, 90, 0, 0, 0, 37, 1, 1, 0, 0),
(129, 'Дуе', 'Чалета-Цар', 'Хорватия', 15, 22, 1, 90, 0, 0, 0, 36, 0, 0, 0, 0),
(130, 'Домагой', 'Вида', 'Хорватия', 21, 30, 6, 630, 1, 1, 3, 309, 12, 1, 0, 0),
(131, 'Йосип', 'Пиварич', 'Хорватия', 22, 30, 4, 201, 0, 1, 2, 130, 2, 1, 0, 0),
(132, 'Иван', 'Ракитич', 'Хорватия', 7, 31, 7, 639, 1, 0, 17, 424, 7, 1, 0, 0),
(133, 'Матео', 'Ковачич', 'Хорватия', 8, 25, 5, 183, 0, 1, 4, 122, 8, 0, 0, 0),
(134, 'Лука', 'Модрич', 'Хорватия', 10, 33, 7, 694, 2, 1, 10, 523, 11, 0, 0, 0),
(135, 'Марцело', 'Брозович', 'Хорватия', 11, 26, 6, 458, 0, 1, 4, 380, 9, 1, 0, 0),
(136, 'Филип', 'Брадарич', 'Хорватия', 14, 27, 1, 25, 0, 0, 0, 11, 0, 0, 0, 0),
(137, 'Милан', 'Бадель', 'Хорватия', 19, 30, 3, 103, 1, 1, 2, 74, 5, 0, 0, 0),
(138, 'Иван', 'Перишич', 'Хорватия', 4, 30, 7, 632, 3, 1, 22, 190, 4, 0, 0, 0),
(139, 'Андрей', 'Крамарич', 'Хорватия', 9, 28, 7, 333, 1, 0, 10, 142, 0, 0, 0, 0),
(140, 'Никола', 'Калинич', 'Хорватия', 16, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(141, 'Марио', 'Манджукич', 'Хорватия', 17, 33, 6, 608, 3, 1, 13, 168, 9, 2, 0, 0),
(142, 'Анте', 'Ребич', 'Хорватия', 18, 25, 6, 547, 1, 0, 16, 126, 8, 2, 0, 0),
(143, 'Марко', 'Пьяца', 'Хорватия', 20, 24, 3, 83, 0, 0, 1, 25, 0, 1, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `teams`
--

CREATE TABLE `teams` (
  `team_id` int(11) NOT NULL,
  `team_name` varchar(30) NOT NULL,
  `team_games` int(11) NOT NULL,
  `team_goals` int(11) NOT NULL,
  `team_missed` int(11) NOT NULL,
  `team_hits` int(11) NOT NULL,
  `team_fouls` int(11) NOT NULL,
  `team_yellow` int(11) NOT NULL,
  `team_red` int(11) NOT NULL,
  `team_group` varchar(2) NOT NULL,
  `team_group_wins` int(10) NOT NULL,
  `team_group_draws` int(10) NOT NULL,
  `team_group_points` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `teams`
--

INSERT INTO `teams` (`team_id`, `team_name`, `team_games`, `team_goals`, `team_missed`, `team_hits`, `team_fouls`, `team_yellow`, `team_red`, `team_group`, `team_group_wins`, `team_group_draws`, `team_group_points`) VALUES
(1, 'Австралия', 3, 2, 5, 32, 37, 7, 0, 'C', 0, 1, 1),
(2, 'Англия', 7, 12, 8, 96, 72, 8, 0, 'G', 2, 0, 6),
(3, 'Аргентина', 4, 6, 9, 53, 55, 11, 0, 'D', 1, 1, 4),
(4, 'Бельгия', 7, 16, 6, 106, 99, 11, 0, 'G', 3, 0, 9),
(5, 'Бразилия', 5, 8, 3, 103, 50, 7, 0, 'E', 2, 1, 7),
(6, 'Германия', 3, 2, 4, 67, 29, 2, 1, 'F', 1, 0, 3),
(7, 'Дания', 4, 3, 2, 40, 54, 6, 0, 'C', 1, 2, 5),
(8, 'Египет', 3, 2, 6, 29, 38, 5, 0, 'A', 0, 0, 0),
(9, 'Иран', 3, 2, 2, 21, 44, 7, 0, 'B', 1, 1, 4),
(10, 'Исландия', 3, 2, 5, 36, 35, 3, 0, 'D', 0, 1, 1),
(11, 'Испания', 4, 7, 6, 70, 34, 2, 0, 'B', 1, 2, 5),
(12, 'Колумбия', 4, 6, 3, 39, 63, 9, 1, 'H', 2, 0, 6),
(13, 'Коста-Рика', 3, 2, 5, 28, 43, 6, 0, 'E', 0, 1, 1),
(14, 'Марокко', 3, 2, 4, 35, 62, 8, 0, 'B', 0, 1, 1),
(15, 'Мексика', 4, 3, 6, 57, 54, 9, 0, 'F', 2, 0, 6),
(16, 'Нигерия', 3, 3, 4, 39, 45, 4, 0, 'D', 1, 0, 3),
(17, 'Панама', 3, 2, 11, 23, 49, 11, 0, 'G', 0, 0, 0),
(18, 'Перу', 3, 2, 2, 32, 37, 5, 0, 'C', 1, 0, 3),
(19, 'Польша', 3, 2, 5, 30, 31, 3, 0, 'H', 1, 0, 3),
(20, 'Португалия', 4, 6, 6, 52, 55, 7, 0, 'B', 1, 2, 5),
(21, 'Республика Корея', 3, 3, 3, 33, 63, 10, 0, 'F', 1, 0, 3),
(22, 'Россия', 5, 11, 7, 46, 95, 6, 1, 'A', 2, 0, 6),
(23, 'Саудовская Аравия', 3, 2, 7, 36, 30, 1, 0, 'A', 1, 0, 3),
(24, 'Сенегал', 3, 4, 4, 30, 44, 6, 0, 'H', 1, 1, 4),
(25, 'Сербия', 3, 2, 4, 32, 45, 9, 0, 'E', 1, 0, 3),
(26, 'Тунис', 3, 5, 8, 36, 46, 4, 0, 'G', 1, 0, 3),
(27, 'Уругвай', 5, 7, 3, 61, 63, 3, 0, 'A', 3, 0, 9),
(28, 'Франция', 7, 14, 6, 83, 93, 12, 0, 'C', 2, 1, 7),
(29, 'Хорватия', 7, 14, 9, 115, 114, 15, 0, 'D', 3, 0, 9),
(30, 'Швейцария', 4, 5, 5, 56, 53, 9, 1, 'E', 1, 2, 5),
(31, 'Швеция', 5, 6, 4, 55, 65, 8, 0, 'F', 2, 0, 6),
(32, 'Япония', 4, 6, 7, 42, 37, 5, 0, 'H', 1, 1, 4);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`) VALUES
(13, 'first', 'm@mail.ru', '202cb962ac59075b964b07152d234b70'),
(14, 'Murat', 'muratsalakhov@gmail.com', '2279d268159fa29c3efd11fd2eea1c8e');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `matches`
--
ALTER TABLE `matches`
  ADD PRIMARY KEY (`match_id`);

--
-- Индексы таблицы `players`
--
ALTER TABLE `players`
  ADD PRIMARY KEY (`player_id`);

--
-- Индексы таблицы `teams`
--
ALTER TABLE `teams`
  ADD PRIMARY KEY (`team_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `matches`
--
ALTER TABLE `matches`
  MODIFY `match_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT для таблицы `players`
--
ALTER TABLE `players`
  MODIFY `player_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=144;

--
-- AUTO_INCREMENT для таблицы `teams`
--
ALTER TABLE `teams`
  MODIFY `team_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
